wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_gpio.h
/* GPIO_BC */
#define GPIO_BC_CR0                BIT(0)                          /*!< pin 0 clear bit */
#define GPIO_BC_CR1                BIT(1)                          /*!< pin 1 clear bit */
#define GPIO_BC_CR2                BIT(2)                          /*!< pin 2 clear bit */
#define GPIO_BC_CR3                BIT(3)                          /*!< pin 3 clear bit */
#define GPIO_BC_CR4                BIT(4)                          /*!< pin 4 clear bit */
#define GPIO_BC_CR5                BIT(5)                          /*!< pin 5 clear bit */
#define GPIO_BC_CR6                BIT(6)                          /*!< pin 6 clear bit */
#define GPIO_BC_CR7                BIT(7)                          /*!< pin 7 clear bit */
#define GPIO_BC_CR8                BIT(8)                          /*!< pin 8 clear bit */
#define GPIO_BC_CR9                BIT(9)                          /*!< pin 9 clear bit */
#define GPIO_BC_CR10               BIT(10)                         /*!< pin 10 clear bit */
#define GPIO_BC_CR11               BIT(11)                         /*!< pin 11 clear bit */
#define GPIO_BC_CR12               BIT(12)                         /*!< pin 12 clear bit */
#define GPIO_BC_CR13               BIT(13)                         /*!< pin 13 clear bit */
#define GPIO_BC_CR14               BIT(14)                         /*!< pin 14 clear bit */
#define GPIO_BC_CR15               BIT(15)                         /*!< pin 15 clear bit */

/* AFIO_EXTISS0 */
#define AFIO_EXTI0_SS              BITS(0,3)                       /*!< EXTI 0 sources selection */
#define AFIO_EXTI1_SS              BITS(4,7)                       /*!< EXTI 1 sources selection */
#define AFIO_EXTI2_SS              BITS(8,11)                      /*!< EXTI 2 sources selection */
#define AFIO_EXTI3_SS              BITS(12,15)                     /*!< EXTI 3 sources selection */

/* AFIO_EXTISS1 */
#define AFIO_EXTI4_SS              BITS(0,3)                       /*!< EXTI 4 sources selection */
#define AFIO_EXTI5_SS              BITS(4,7)                       /*!< EXTI 5 sources selection */
#define AFIO_EXTI6_SS              BITS(8,11)                      /*!< EXTI 6 sources selection */
#define AFIO_EXTI7_SS              BITS(12,15)                     /*!< EXTI 7 sources selection */

/* AFIO_EXTISS2 */
#define AFIO_EXTI8_SS              BITS(0,3)                       /*!< EXTI 8 sources selection */
#define AFIO_EXTI9_SS              BITS(4,7)                       /*!< EXTI 9 sources selection */
#define AFIO_EXTI10_SS             BITS(8,11)                      /*!< EXTI 10 sources selection */
#define AFIO_EXTI11_SS             BITS(12,15)                     /*!< EXTI 11 sources selection */

/* AFIO_EXTISS3 */
#define AFIO_EXTI12_SS             BITS(0,3)                       /*!< EXTI 12 sources selection */
#define AFIO_EXTI13_SS             BITS(4,7)                       /*!< EXTI 13 sources selection */
#define AFIO_EXTI14_SS             BITS(8,11)                      /*!< EXTI 14 sources selection */
#define AFIO_EXTI15_SS             BITS(12,15)                     /*!< EXTI 15 sources selection */

/* constants definitions */
typedef FlagStatus bit_status;

/* output mode definitions */
#define CTL_CLTR(regval)           (BITS(0,1) & ((uint32_t)(regval) << 0))
#define GPIO_MODE_INPUT            CTL_CLTR(0)                     /*!< input mode */
#define GPIO_MODE_OUTPUT           CTL_CLTR(1)                     /*!< output mode */
#define GPIO_MODE_AF               CTL_CLTR(2)                     /*!< alternate function mode */
#define GPIO_MODE_ANALOG           CTL_CLTR(3)                     /*!< analog mode */

/* pull-up/pull-down definitions */
#define PUD_PUPD(regval)           (BITS(0,1) & ((uint32_t)(regval) << 0))
#define GPIO_PUPD_NONE             PUD_PUPD(0)                     /*!< floating mode, no pull-up and pull-down resistors */
#define GPIO_PUPD_PULLUP           PUD_PUPD(1)                     /*!< with pull-up resistor */
#define GPIO_PUPD_PULLDOWN         PUD_PUPD(2)                     /*!< with pull-down resistor */

/* GPIO mode configuration values */
#define GPIO_MODE_SET(n, mode)     ((uint32_t)((uint32_t)(mode) << (2U * (n))))
#define GPIO_MODE_MASK(n)          (0x3U << (2U * (n)))

/* GPIO pull-up/pull-down values */
#define GPIO_PUPD_SET(n, pupd)     ((uint32_t)((uint32_t)(pupd) << (2U * (n))))
#define GPIO_PUPD_MASK(n)          (0x3U << (2U * (n)))

/* GPIO output speed values */
#define GPIO_OSPEED_SET(n, speed)  ((uint32_t)((uint32_t)(speed) << (2U * (n))))
#define GPIO_OSPEED_MASK(n)        (0x3U << (2U * (n)))

/* GPIO output type */
#define GPIO_OTYPE_PP              ((uint8_t)(0x00U))              /*!< push pull mode */
#define GPIO_OTYPE_OD              ((uint8_t)(0x01U))              /*!< open drain mode */

/* GPIO output max speed value */
#define OSPD_OSPD0(regval)         (BITS(0,1) & ((uint32_t)(regval) << 0))
#define GPIO_OSPEED_LEVEL0         OSPD_OSPD0(0)                   /*!< output max speed level 0 */
#define GPIO_OSPEED_LEVEL1         OSPD_OSPD0(1)                   /*!< output max speed level 1 */
#define GPIO_OSPEED_LEVEL2         OSPD_OSPD0(2)                   /*!< output max speed level 2 */
#define GPIO_OSPEED_LEVEL3         OSPD_OSPD0(3)                   /*!< output max speed level 3 */

/* GPIO output port source definitions */
#define GPIO_PORT_SOURCE_GPIOA           ((uint8_t)0x00U)          /*!< output port source A */
#define GPIO_PORT_SOURCE_GPIOB           ((uint8_t)0x01U)          /*!< output port source B */
#define GPIO_PORT_SOURCE_GPIOC           ((uint8_t)0x02U)          /*!< output port source C */
#define GPIO_PORT_SOURCE_GPIOD           ((uint8_t)0x03U)          /*!< output port source D */
#define GPIO_PORT_SOURCE_GPIOE           ((uint8_t)0x04U)          /*!< output port source E */

/* GPIO output pin source definitions */
#define GPIO_PIN_SOURCE_0                ((uint8_t)0x00U)          /*!< GPIO pin source 0 */
#define GPIO_PIN_SOURCE_1                ((uint8_t)0x01U)          /*!< GPIO pin source 1 */
#define GPIO_PIN_SOURCE_2                ((uint8_t)0x02U)          /*!< GPIO pin source 2 */
#define GPIO_PIN_SOURCE_3                ((uint8_t)0x03U)          /*!< GPIO pin source 3 */
#define GPIO_PIN_SOURCE_4                ((uint8_t)0x04U)          /*!< GPIO pin source 4 */
#define GPIO_PIN_SOURCE_5                ((uint8_t)0x05U)          /*!< GPIO pin source 5 */
#define GPIO_PIN_SOURCE_6                ((uint8_t)0x06U)          /*!< GPIO pin source 6 */
#define GPIO_PIN_SOURCE_7                ((uint8_t)0x07U)          /*!< GPIO pin source 7 */
#define GPIO_PIN_SOURCE_8                ((uint8_t)0x08U)          /*!< GPIO pin source 8 */
#define GPIO_PIN_SOURCE_9                ((uint8_t)0x09U)          /*!< GPIO pin source 9 */
#define GPIO_PIN_SOURCE_10               ((uint8_t)0x0AU)          /*!< GPIO pin source 10 */
#define GPIO_PIN_SOURCE_11               ((uint8_t)0x0BU)          /*!< GPIO pin source 11 */
#define GPIO_PIN_SOURCE_12               ((uint8_t)0x0CU)          /*!< GPIO pin source 12 */
#define GPIO_PIN_SOURCE_13               ((uint8_t)0x0DU)          /*!< GPIO pin source 13 */
#define GPIO_PIN_SOURCE_14               ((uint8_t)0x0EU)          /*!< GPIO pin source 14 */
#define GPIO_PIN_SOURCE_15               ((uint8_t)0x0FU)          /*!< GPIO pin source 15 */

